# 2. Реализовать функцию, принимающую несколько параметров, описывающих данные пользователя:
# имя, фамилия, год рождения, город проживания, email, телефон.
# Функция должна принимать параметры как именованные аргументы.
# Реализовать вывод данных о пользователе одной строкой.
first_name = input("Ваше имя ")
last_name = input("Ваша фамилия ")
city = input("Ваша город ")
year_of_birth = input("Год рождения ")
email = input("Ваша почта ")
phone_number = input("Ввш номер телефона без ")


def my_info():
    return
print(f'Данные пользователя:  Имя - {first_name}, Фамилия - {last_name}, Город - {city}, Год рождения - {year_of_birth}, Email - {email}, Номер телефона - {phone_number}')
